jorgebucaran/fisher
jethrokuan/z
jorgebucaran/fishtape
edc/bass
IlanCosman/tide@v5
franciscolourenco/done
jomik/fish-gruvbox
jorgebucaran/spark.fish
jorgebucaran/autopair.fish
acomagu/fish-async-prompt
jorgebucaran/getopts.fish
tomyun/base16-fish
